app/views/cockroaches/index.html.erb

    <% @cockroaches.each do |cockroach| %>
      <% @current_user.matches.each do |match| %>
---
SELECT "matches".* FROM "matches" WHERE "matches"."user_id" = ?  [["user_id", 6]]