app/views/users/show.html.erb

<div id="user_show_page_matches">
<% if @user.matches.count == 0 %>
---
SELECT "matches".* FROM "matches" WHERE "matches"."user_id" = ?  [["user_id", 15]]
SELECT COUNT(*) FROM "matches" WHERE "matches"."user_id" = ?  [["user_id", 5]]


<% @user.matches.each do |f| %>
---
SELECT "matches".* FROM "matches" WHERE "matches"."user_id" = ?  [["user_id", 5]]