app/views/matches/index.html.erb


<% Match.all.each do |f| %>
---
SELECT "matches".* FROM "matches"