app/views/matches/new.html.erb

<%= f.label :cockroach_id, value = "Select your cockroach" %><br>
<%= f.collection_select :cockroach_id, Cockroach.all, :id, :name %><br>
---
SELECT "cockroaches".* FROM "cockroaches"

<%= f.label :user_id, value = "Please enter the name you would like your cockroach to see?" %><br>
<%= f.collection_select :user_id, User.all, :id, :name %><br>
---
SELECT "users".* FROM "users"