app/controllers/cockroaches_controller.rb

SELECT "cockroaches".* FROM "cockroaches"
---
    def index
        @cockroaches = Cockroach.all

SELECT "cockroaches".* FROM "cockroaches" WHERE "cockroaches"."id" = ? LIMIT ?  [["id", 44], ["LIMIT", 1]]
---
    def show
        @cockroach = Cockroach.find(params[:id])