app/controllers/matches_controller.rb

    def index
        @match = Match.all
---
SELECT "matches".* FROM "matches" ORDER BY "matches"."id" ASC LIMIT ?  [["LIMIT", 1]]

    def show
        @match = Match.find(params[:id])
---
SELECT "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def create
        @cockroach = Cockroach.find(params[:id])
        @match = Match.create(user_id: @current_user.id, cockroach_id: @cockroach.id)
---
SELECT "cockroaches".* FROM "cockroaches" WHERE "cockroaches"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
INSERT INTO "matches" ("user_id", "cockroach_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 12], ["cockroach_id", 24], ["created_at", "2020-08-19 18:37:13.604092"], ["updated_at", "2020-08-19 18:37:13.604092"]]

    def destroy
        @match = Match.find(params[:id])
        @match.destroy
---
SELECT "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
DELETE FROM "matches" WHERE "matches"."id" = ?  [["id", 18]]