app/controllers/users_controller.rb

    def create
        user = User.create(user_params)
---
INSERT INTO "users" ("name", "age", "bio", "img_url", "preference", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def update
        @user = User.update(user_params)
---
UPDATE "users" SET "img_url" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["img_url", "https://images.gr-assets.com/users/1480796677p6/62190775.jpg"], ["updated_at", "2020-08-18 20:45:47.841806"], ["id", 4]]